{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "สวัสดี",
                "หวัดดี",
                "มีใครอยู่ที่นั่นไหม",
                "ไง",
                "สบายดีไหม"
            ],
            "responses": [
                "สวัสดี",
                "มีอะไรให้ช่วยไหม?",
                "ถามฉันมาได้เลย",
                "เป็นอย่างไรบ้าง"
            ]
        },
        {
            "tag": "goodbye",
            "patterns": [
                "ลาก่อน",
                "แล้วพบกันใหม่",
                "ขอบคุณ",
                "ขอบคุณครับ",
                "ขอบคุณค่ะ",
                "บาย",
                "บ้ายบาย"
            ],
            "responses": [
                "แล้วคบกันใหม่",
                "ยินดีที่ได้ช่วย",
                "ลาก่อน มีอะไรให้ช่วยบอกได้เสมอเลย",
                "ขอให้เป็นวันที่ดี",
                "ฉันอยู่ตรงนี้เสมอ"
            ]
        },
        {
            "tag": "thanks",
            "patterns": [
                "ขอบใจ",
                "ขอบคุณ"
            ],
            "responses": [
                "ดีใจที่ได้ช่วย",
                "มีอะไรให้ช่วยก็บอกนะ",
                "ยินดีที่ได้ช่วย",
                "ขอแค่คุณมีสุขภาพดีผมก็ดีใจแล้ว",
                "ขอแค่คุณมีสุขภาพดีฉันก็ดีใจแล้ว"
            ]
        },
        {
            "tag": "name",
            "patterns": [
                "คุณชื่ออะไร",
                "ชื่ออะไร",
                "คุณเป็นใคร"
            ],
            "responses": [
                "สวัสดี ฉัน มะกรูด",
                "มะกรูด"
            ]
        },
        {
            "tag": "help",
            "patterns": [
                "มีอะไรให้ช่วย",
                "ช่วยได้ไหม",
                "ทำอะไรให้ได้บ้าง",
                "ต้องการความช่วยเหลือ",
                "ช่วยด้วย"
            ],
            "responses": [
                "ว่ามาเลย",
                "บอกฉันถ้ามีอะไรให้ช่วย",
                "คุณรู้สึกอย่างไร",
                "มีอาการอะไรบ้าง"
            ]
        },
        {
            "tag": "headache",
            "patterns": [
                "ปวดหัว",
                "ฉันปวดหัว",
                "ฉันมีอาการปวดหัว",
                "เจ็บหัว",
                "ฉันเจ็บหัว"
            ],
            "responses": [
                "คุณปวดหัวอย่างไร",
                "คุณเจ็บหัวอย่างไร"
            ]
        },
        {
            "tag": "headacheLeft",
            "patterns": [
                "ฉันปวดหัวซีกซ้าย"
            ],
            "responses": [
                "ความเป็นไปได้จากอาการของคุณ ปวดหัวจากความเครียด\nเป็นประเภทที่พบได้บ่อยที่สุดในหมู่ผู้ใหญ่และวัยรุ่น ซึ่งอาจทำให้เกิดอาการปวดหัวเล็กน้อยไปจนถึงปานกลาง และมักเกิดอาการแบบเป็น ๆ หาย ๆ โดยผู้ป่วยอาจรู้สึกปวดคล้ายโดนบีบรัดบริเวณรอบศีรษะ อย่างใบหน้า หนังศีรษะ ศีรษะทั้งสองข้าง ศีรษะด้านหลัง และอาจรู้สึกปวดที่ลำคอหรือหัวไหล่ด้วย อย่างไรก็ตาม การปวดหัวประเภทนี้มักไม่มีอาการอื่น ๆ ร่วมด้วย"
            ]
        },
        {
            "tag": "headacheRight",
            "patterns": [
                "ฉันปวดหัวซีกขวา"
            ],
            "responses": [
                "ความเป็นไปได้จากอาการของคุณ ปวดหัวจากความเครียด\nเป็นประเภทที่พบได้บ่อยที่สุดในหมู่ผู้ใหญ่และวัยรุ่น ซึ่งอาจทำให้เกิดอาการปวดหัวเล็กน้อยไปจนถึงปานกลาง และมักเกิดอาการแบบเป็น ๆ หาย ๆ โดยผู้ป่วยอาจรู้สึกปวดคล้ายโดนบีบรัดบริเวณรอบศีรษะ อย่างใบหน้า หนังศีรษะ ศีรษะทั้งสองข้าง ศีรษะด้านหลัง และอาจรู้สึกปวดที่ลำคอหรือหัวไหล่ด้วย อย่างไรก็ตาม การปวดหัวประเภทนี้มักไม่มีอาการอื่น ๆ ร่วมด้วย"
            ]
        },
        {
            "tag": "แก้ม",
            "patterns": [
                "ฉันปวดบริเวณแก้ม",
                "แก้ม",
                "ใบหน้า",
                "บริเวณใบหน้า",
                "บริเวณแก้ม"
            ],
            "responses": [
                "อาการปวดหน่วงๆ บริเวณศีรษะ หน้าผาก หัวตา โหนกแก้ม รอบดวงตา หรือมีน้ำมูกเป็นหนองข้น อาจสันนิษฐานได้ว่า ไซนัสอักเสบ หากปล่อยไว้จนอาการลามไปถึงกระดูก อาจทำให้การอักเสบกระจายไปสู่สมอง ส่งผลให้การรักษายากขึ้น และเสียชีวิตได้ในที่สุด"
            ]
        },
        {
            "tag": "stomach",
            "patterns": [
                "ปวดท้อง",
                "ฉันเจ็บท้อง"
            ],
            "responses": [
                "คุณปวดท้องบริเวณไหน",
                "ความเป็นไปได้จากอาการของคุณ ปวดหัวจากการเกร็งของกล้ามเนื้อหน้าผาก ขมับ 2 ข้าง บางครั้งร้าวมาด้านหลังศีรษะ ต้นคอ บ่า ไหล่ สัมพันธ์กับความเครียด\nปวดหัวจากโรคไมเกรน ขมับด้านใดด้านหนึ่ง อาจปวดร้าวมาที่กระบอกตา มีอาการคลื่นไส้ อาเจียน อาการอาจแย่ลง เมื่อเจอแสงจ้าหรือกลิ่นฉุน\nปวดหัวจากโรคไซนัสอักเสบ โหนกแก้มสองข้าง หรือบริเวณดั้งจมูก\nปวดหัวจากความผิดปกติของสมอง ปวดหัวอย่างรุนแรงมาก ๆ มองเห็นผิดปกติ มีอาการชา กล้ามเนื้ออ่อนแรง ชัก\nปวดหัวจากการอักเสบของกราม\nบริเวณหน้าใบหู สัมพันธ์กับการเคี้ยวอาหารและกัดฟันเวลานอน"
            ]
        },
        {
            "tag": "ชายโครงขวา",
            "patterns": [
                "บริเวณใต้ชายโครงขวา",
                "ทางขวา"
            ],
            "responses": [
                "ความเป็นไปได้จากอาการของคุณ เป็นจุดของตับและถุงน้ำดี หากกดแล้วเป็นก้อนแข็งๆ บวกกับอาการตัวเหลือง หมายถึงความบกพร่องของตับและถุงน้ำดี หากปวดมากควรรีบพบแพทย์"
            ]
        },
        {
            "tag": "บริเวณใต้ลิ้นปี่",
            "patterns": [
                "บริเวณใต้ลิ้นปี่",
                "ตรงกลาง"
            ],
            "responses": [
                "ความเป็นไปได้จากอาการของคุณ หากคลำเจอก้อนเนื้อขนาดใหญ่ และแข็งแสดงว่าตับโต หรือหากคลำได้ก้อนสามเหลี่ยมแบนเล็กๆ อาจเป็นกระดูกลิ้นปี่"
            ]
        },
        {
            "tag": "บริเวณชายโครงซ้าย",
            "patterns": [
                "บริเวณชายโครงซ้าย",
                "ทางซ้าย"
            ],
            "responses": [
                "ความเป็นไปได้จากอาการของคุณ จะตรงกับตำแหน่งของม้าม อย่ามัวรีรอรีบไปพบแพทย์"
            ]
        },
        {
            "tag": "บริเวณบั้นเอวขวาหรือซ้าย",
            "patterns": [
                "บริเวณบั้นเอวขวาหรือซ้าย",
                "บริเวณบั้นเอว",
                "ตรงกลาง"
            ],
            "responses": [
                "ความเป็นไปได้จากอาการของคุณ ปวดเอวหรือมีปัสสาวะเป็นเลือดอาจจะเป็นนิ่วที่ไต จะเป็นข้างใดข้างหนึ่งหรือสองข้างก็ได้ ซึ่งจะมีอาการปวดมากจนเหงื่อออก"
            ]
        },
        {
            "tag": "บริเวณรอบสะดือ",
            "patterns": [
                "บริเวณรอบสะดือ",
                "สะดือ",
                "ตรงกลาง"
            ],
            "responses": [
                "ความเป็นไปได้จากอาการของคุณ ตรงกับตำแหน่งลำไส้เล็ก มักจะมีอาการปวดบิด ถ่ายเหลว คลื่นไส้ อาเจียน หากกดแล้วปวดมากอาจเป็นไส้ติ่งอักเสบ ปวดจนทนไม่ไหวให้พบแพทย์ทันที"
            ]
        },
        {
            "tag": "บริเวณท้องน้อยขวา",
            "patterns": [
                "บริเวณท้องน้อยขวา",
                "ท้องน้อย",
                "ท้องน้อยขวา"
            ],
            "responses": [
                "ความเป็นไปได้จากอาการของคุณ เป็นตำแหน่งไส้ติ่ง ท่อไต ปากมดลูก และรังไข่ขวา"
            ]
        },
        {
            "tag": "ท้องน้อย",
            "patterns": [
                "ท้องน้อย",
                "ปวดท้องน้อย",
                "ท้องน้อย"
            ],
            "responses": [
                "ความเป็นไปได้จากอาการของคุณ ตรงตำแหน่งกระเพาะปัสสาวะ และมดลูก"
            ]
        },
        {
            "tag": "ปวดท้องน้อยซ้าย",
            "patterns": [
                "ท้องน้อย",
                "ปวดท้องน้อยซ้าย",
                "ท้องน้อย"
            ],
            "responses": [
                "ความเป็นไปได้จากอาการของคุณ ตำแหน่งปีกมดลูกและท่อไต รังไข่ด้านซ้าย ลำไส้ใหญ่ส่วนปลาย"
            ]
        },
        {
            "tag": "ปวดหลัง",
            "patterns": [
                "หลัง",
                "ปวดหลัง",
                "ฉันปวดหลัง",
                "ไหล่",
                "ปวดไหล่",
                "ฉันปวดไหล่"
            ],
            "responses": [
                "ความรู้สึกไม่สบายที่เกิดที่ตำแหน่งใดก็ได้บนกระดูกสันหลังหรือหลัง ซึ่งมีหลายระดับตั้งแต่เล็กน้อยไปจนถึงไม่สามารถทำอะไรได้เลย อาการของคุณอยู่บริเวณใด"
            ]
        },
        {
            "tag": "ปวดหลังด้าน",
            "patterns": [
                "ปวดข้างหลัง",
                "ฉันปวดหลังด้านซ้าย",
                "ไหล่หลัง",
                "ปวดหลังไหล่",
                "ฉันปวดหลังด้านขวา"
            ],
            "responses": [
                "อาการปวดหลังด้านซ้ายหรือปวดหลังด้านขวา มักมีสาเหตุจากกล้ามเนื้อหลังผิดปกติ ข้อต่อกระดูกส่วนอก หรือกระดูกซี่โครงอ่อนอักเสบ อุบัติเหตุ การกระแทก การเกร็งหรือยกของหนัก"
            ]
        }
    ]
}